src/cf/InformationRegisters/пбп_ТокеныИнтегрируемыхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>пбп_ТокеныИнтегрируемыхСистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокЖизниДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнтегрируемаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтегрируемыеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.пбп_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.пбп_Пользователи</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнешнийПользователь</Name>
					<Comment>Логин, идентификатор, ClientID и т.д.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сущность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_СущностиАвторизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/пбп_ТокеныИнтегрируемыхСистем/Ext/ManagerModule.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить записи
//
// Параметры:
//  ИнтегрируемаяСистема - СправочникСсылка.пбп_ИнтегрируемыеСистемы - интегрируемая система
//  Организация			 - ОпределяемыйТип.пбп_Организации			 - организация
//  Пользователь		 - ОпределяемыйТип.пбп_Пользователи			 - пользователь
// 
// Возвращаемое значение:
//  ТаблицаЗначений - данные значений сущностей авторизации с колонками:
//   - Сущность		 - ПеречислениеСсылка.пбп_СущностиАвторизации	 - сущность авторизации
//   - Значение		 - ХранилищеЗначения							 - значение токена, кода и пр.
//   - СрокЖизниДо	 - СрокЖизниДо									 - срок жизни токена, кода и пр.
//
Функция ПолучитьЗаписи(ИнтегрируемаяСистема, Организация = Неопределено,
	Пользователь = Неопределено, ВнешнийПользователь = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИнтегрируемаяСистема", ИнтегрируемаяСистема);
	Запрос.Текст = "ВЫБРАТЬ
	|	пбп_ТокеныИнтегрируемыхСистем.Сущность КАК Сущность,
	|	пбп_ТокеныИнтегрируемыхСистем.Значение КАК Значение,
	|	пбп_ТокеныИнтегрируемыхСистем.СрокЖизниДо КАК СрокЖизниДо
	|ИЗ
	|	РегистрСведений.пбп_ТокеныИнтегрируемыхСистем КАК пбп_ТокеныИнтегрируемыхСистем
	|ГДЕ
	|	пбп_ТокеныИнтегрируемыхСистем.ИнтегрируемаяСистема = &ИнтегрируемаяСистема";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
		
		УсловияЗапроса = "пбп_ТокеныИнтегрируемыхСистем.Организация = &Организация";
		Запрос = пбп_СхемыЗапросов.ДобавитьОтборВЗапрос(Запрос, УсловияЗапроса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Пользователь) Тогда
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		
		УсловияЗапроса = "пбп_ТокеныИнтегрируемыхСистем.Пользователь = &Пользователь";
		Запрос = пбп_СхемыЗапросов.ДобавитьОтборВЗапрос(Запрос, УсловияЗапроса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВнешнийПользователь) Тогда
		Запрос.УстановитьПараметр("ВнешнийПользователь", ВнешнийПользователь);
		
		УсловияЗапроса = "пбп_ТокеныИнтегрируемыхСистем.ВнешнийПользователь = &ВнешнийПользователь";
		Запрос = пбп_СхемыЗапросов.ДобавитьОтборВЗапрос(Запрос, УсловияЗапроса);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыгрузкаРезультатаЗапроса = РезультатЗапроса.Выгрузить();
	
	Возврат ВыгрузкаРезультатаЗапроса;
	
КонецФункции

// Добавить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * ИнтегрируемаяСистема	 - СправочникСсылка.пбп_ИнтегрируемыеСистемы	 - интегрируемая система
//   * Организация			 - ОпределяемыйТип.пбп_Организации				 - организация, которой назначен токен
//   * Пользователь			 - Строка										 - пользователь системы, которому назначен токен
//   * ВнешнийПользователь	 - Строка										 - идентификатор пользователя внешней системы.
// Идентификатором может являтся: логин, внутренний идентификатор, clientID и т.д.
//   * Сущность				 - ПеречислениеСсылка.пбп_СущностиАвторизации	 - секрет клиента, авто-код, сгенерированный
// другой системой для получения токенов доступа и обновления или токен доступа/обновления
//   * Значение				 - ХранилищеЗначения или Строка					 - значение. Если передана строка,
// то она будет помещена в ХранилищеЗначений
//   * СтрокЖизниДо			 - Дата											 - дата время до которой живет значение
//
Процедура ДобавитьЗапись(ПараметрыЗаписи) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ИнтегрируемаяСистема) Тогда
		ВызватьИсключение НСтр("ru='Не указана интегрируемая система'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.Сущность) Тогда
		ВызватьИсключение НСтр("ru='Не указана сущность авторизации'");
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		
		ИсключаемыеСвойства = "";
		ЗначениеВХранилище = Неопределено;
		Если ТипЗнч(ПараметрыЗаписи.Значение) = Тип("Строка") Тогда
			ИсключаемыеСвойства = "Значение";
			ЗначениеВХранилище = Новый ХранилищеЗначения(ПараметрыЗаписи.Значение);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи, , ИсключаемыеСвойства);
		Если ЗначениеВХранилище <> Неопределено Тогда
			МенеджерЗаписи.Значение = ЗначениеВХранилище;
		КонецЕсли;
		
		МенеджерЗаписи.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Ошибка добавления записи токенов интегрируемых систем'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, 
			, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Изменить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * ИнтегрируемаяСистема	 - СправочникСсылка.пбп_ИнтегрируемыеСистемы	 - интегрируемая система
//   * Организация			 - ОпределяемыйТип.пбп_Организации				 - организация, которой назначен токен
//   * Пользователь			 - Строка										 - пользователь системы, которому назначен токен
//   * ВнешнийПользователь	 - Строка										 - идентификатор пользователя внешней системы.
// Идентификатором может являтся: логин, внутренний идентификатор, clientID и т.д.
//   * Сущность				 - ПеречислениеСсылка.пбп_СущностиАвторизации	 - секрет клиента, авто-код, сгенерированный
// другой системой для получения токенов доступа и обновления или токен доступа/обновления
//   * Значение				 - ХранилищеЗначения или Строка					 - значение. Если передана строка,
// то она будет помещена в ХранилищеЗначений
//   * СтрокЖизниДо			 - Дата											 - дата время до которой живет значение
//
Процедура ИзменитьЗапись(ПараметрыЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(ПараметрыЗаписи.ИнтегрируемаяСистема) Тогда
		НаборЗаписей.Отбор.ИнтегрируемаяСистема.Установить(ПараметрыЗаписи.ИнтегрируемаяСистема);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыЗаписи.ВнешнийПользователь) Тогда
		НаборЗаписей.Отбор.ВнешнийПользователь.Установить(ПараметрыЗаписи.ВнешнийПользователь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыЗаписи.Сущность) Тогда
		НаборЗаписей.Отбор.Сущность.Установить(ПараметрыЗаписи.Сущность);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("Организация")
		И ЗначениеЗаполнено(ПараметрыЗаписи.Организация) Тогда
		НаборЗаписей.Отбор.Организация.Установить(ПараметрыЗаписи.Организация);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("Пользователь")
		И ЗначениеЗаполнено(ПараметрыЗаписи.Пользователь) Тогда
		НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыЗаписи.Пользователь);
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		
		ИсключаемыеСвойства = "";
		Если ПараметрыЗаписи.Свойство("Значение")
			И ТипЗнч(ПараметрыЗаписи.Значение) = Тип("Строка") Тогда
			ИсключаемыеСвойства = "Значение";
			ЗначениеВХранилище = Новый ХранилищеЗначения(ПараметрыЗаписи.Значение);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Запись, ПараметрыЗаписи, , ИсключаемыеСвойства);
		
		Если ЗначениеВХранилище <> Неопределено Тогда
			Запись.Значение = ЗначениеВХранилище;
		КонецЕсли;
		
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Удалить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * ИнтегрируемаяСистема	 - СправочникСсылка.пбп_ИнтегрируемыеСистемы	 - интегрируемая система
//   * Организация			 - ОпределяемыйТип.пбп_Организации				 - организация, которой назначен токен
//   * Пользователь			 - Строка										 - пользователь системы, которому назначен токен
//   * ВнешнийПользователь	 - Строка										 - идентификатор пользователя внешней системы.
// Идентификатором может являтся: логин, внутренний идентификатор, clientID и т.д.
//   * Сущность				 - ПеречислениеСсылка.пбп_СущностиАвторизации	 - секрет клиента, авто-код, сгенерированный
// другой системой для получения токенов доступа и обновления или токен доступа/обновлени
Процедура УдалитьЗаписи(ПараметрыЗаписи) Экспорт
	
	Если ТипЗнч(ПараметрыЗаписи) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru='Некорректный тип параметра'");
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	Для Каждого КлючИЗначение Из ПараметрыЗаписи Цикл
		Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей.Отбор[КлючИЗначение.Ключ].Установить(КлючИЗначение.Значение);
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Ошибка удаления токена интегрируемых систем'");
		пбп_Переадресация.ДобавитьСообщениеДляЖурналаРегистрации(
			ТекстСообщения,
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли
